#!/usr/bin/python3.8
#
#   task_3-3
#
# Класс Kelvin хранить температуру в кельвинах (атрибут value). Температура в кельвинах не может быть отрицательной.
# Определите в классе методы:
# · Для строкового представления температуры (100.6K).
# · Для истинности температуры (true, если температура отличается от 0 не более чем на 10Е-6).
# · Для сложения, вычитания температур, для умножения температуры на неотрицательное число.
# · Для сравнения температур (две температуры равны, если отличаются не более чем на 10Е-6)